Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Every simple statement must be terminated with a semicolon, unless it is the final statement in a block, in which case the semicolon is optional.
es_es: Cada instrucción simple debe terminarse en un punto y coma excepto si es la última instrucción de un bloque, en cuyo caso el punto y coma es opcional.

source: The names of the classes should be the result of calling C<HvENAME()> on the stash.
es_es: Los nombres de las clases deben ser el resultado de la llamada C<HvENAME()> en el esquema.

source: my $character_count = length $text;
es_es: my $numero_caracteres = length $texto;

source: To extract an ASCII tar archive on VM/ESA, try this:
es_es: Para extraer un archivo tar ASCII en VM/ESA, haga lo siguiente:

source: (If the entry doesn't exist you get an empty list.)
es_es: (Si la entrada no existe, obtendrá una lista vacía).

source: Improved tests.
es_es: Mejora de las pruebas.

source: sort() returns aliases into the original list, much as a for loop's index variable aliases the list elements.
es_es: sort() devuelve alias en la lista original, como lo hace la variable de índice de los bucles for(), que hace un alias de los elementos de la lista.

source: =head2 What's in a name?
es_es: =head2 ¿Qué hay en un nombre?

source: @result = sort { $a <=> $b } grep { $_ == $_ } @input;
es_es: @resultado = sort { $a <=> $b } grep { $_ == $_ } @entrada;

source: If LAYER is present it is a single string, but may contain multiple directives.
es_es: Si CAPA está presente es un único string, pero puede contener múltiples directivas.

source: {n,m}+ Match at least n but not more than m times and give nothing back
es_es: {n,m}+ Coincide al menos n pero no más de m veces y no devuelve nada

source: Each such format generates 1 bit of the result.
es_es: Cada uno de estos formatos genera un bit del resultado.

source: Finally, documentation intended for core Perl developers lives in the F<Porting/> directory.
es_es: Por último, la documentación para programadores del núcleo de Perl se encuentra en el directorio F<Porting/>.

source: Given an expression that specifies an element of a hash, returns true if the specified element in the hash has ever been initialized, even if the corresponding value is undefined.
es_es: Dada una expresión que especifica un elemento de un hash, devuelve verdadero si el elemento especificado en el hash ha sido inicializado, incluso si el correspondiente valor está indefinido.

source: It has been expanded in many ways.
es_es: Ha sido expandido de muchas maneras.

source: pack("n/a* w/a","hello,","world") gives "\000\006hello,\005world"
es_es: pack("n/a* w/a","hello,","world") da "\000\006hello,\005world"

source: You might also have loaded that from a function:
es_es: Es posible que también lo haya cargado a partir de una función:

source: opendir(my $dh, $some_dir) || die;
es_es: opendir(my $dh, $algun_dir) || die;

source: There is experimental support for Linux abstract Unix domain sockets.
es_es: Hay un soporte experimental para los sockets abstractos del dominio Unix en Linux.

source: Without flock() support:
es_es: Sin soporte de flock():

source: my $filename = "filt";
es_es: my $archivo = "filt";

source: # "\000\001\000\002" on big-endian
es_es: # "\000\001\000\002" en big-endian

source: Numeric labels now work
es_es: Las etiquetas numéricas ahora funcionan

source: \E end either case modification or quoted section
es_es: \E fin de modificación de tamaño de caja o sección entrecomillada

source: print 'Hello, world';
es_es: print 'Hola a todos';

source: This feature can be used together with the special variable C<$^N> to capture the results of submatches in variables without having to keep track of the number of nested parentheses.
es_es: Esta característica se puede utilizar con la variable especial C<$^N> para capturar los resultados de las coincidencias parciales en variables sin tener que seguir la pista del número de paréntesis anidados.

source: Note that, if you wish to run Configure non-interactively (see the INSTALL document for details), to have it select the correct hint file, you'll need to provide the argument -Dhintfile=riscos on the Configure command-line.
es_es: Tenga en cuenta que, si desea ejecutar Configure de forma no interactiva (ver el documento INSTALL para más detalles), a su sugerencia de seleccionar el archivo correcto, tendrá que proporcionar el argumento -Dhintfile=riscos en la línea de comando para Configure.

source: If the C<"switch"> feature is enabled, C<continue> is also a function that falls through the current C<when> or C<default> block instead of iterating a dynamically enclosing C<foreach> or exiting a lexically enclosing C<given>.
es_es: Si la característica C<"switch"> está habilitada, C<continue> es también una función que termina el actual bloque C<when> o C<default> en lugar de realizar una iteración de un C<foreach> dinámicamente colocado o saliendo de un C<given> encerrado léxicamente.

source: These languages have their own newsgroups in which you can learn about (but hopefully not argue about) them.
es_es: Estos lenguajes tienen sus propios grupos de noticias, en los que puede obtener más información sobre ellos (preferiblemente sin herir sensibilidades).

source: apple => "red",
es_es: manzana => "rojo",

source: If you like you can force Perl to ignore your system's flock(2) function, and so provide its own fcntl(2)-based emulation, by passing the switch C<-Ud_flock> to the F<Configure> program when you configure and build a new Perl.
es_es: Si le gusta, puede forzar a Perl a que ignore la función de su sistema flock(2) y proveer de su propia emulación basada en fcntl(2), pasando la opción C<-Ud_flock> al programa F<Configure> cuando configure y compile un nuevo Perl.

source: Hexadecimal, octal, or binary, representations in string literals (e.g. '0xff') are not automatically converted to their integer representation.
es_es: Hexadecimal, octal o binario, representaciones en cadenas literales (por ejemplo, '0xff') no se convierten automáticamente en su representación en entero.

source: For example, this:
es_es: Por ejemplo, esto:

source: This rounds up the allocated buckets to the next power of two:
es_es: Esto redondea el número de cajones reservados a la siguiente potencia de dos:

source: For -t and -T,
es_es: Por -t y -T,

source: Please keep in mind that many of them are code fragments rather than complete programs.
es_es: Tenga en cuenta que muchos de estos ejemplos son fragmentos de código, no programas completos.

source: See L<perlre> for additional information on valid syntax for STRING, and for a detailed look at the semantics of regular expressions.
es_es: Ver L<perlre> para obtener información adicional sobre la sintaxis válida para CADENA, y para una vista detallada de la semántica de las expresiones regulares.

source: perl -d:NYTProf some_perl.pl
es_es: perl -d:NYTProf algun_perl.pl

source: First, ensure that you've found an actual bug.
es_es: En primer lugar, debe asegurarse de que se trata realmente de un error.

source: Inside the C<(?{...})> block, C<$_> refers to the string the regular expression is matching against.
es_es: Dentro del bloque C<(?{...})>, C<$_> se refiere a la cadena contra que la expresión regular se está evaluando.

source: There's also I<$foo Magazin>, a German magazine dedicated to Perl, at ( http://www.foo-magazin.de ).
es_es: I<$foo Magazin> ( http://www.foo-magazin.de ) es una revista escrita en alemán dedicada a Perl.

source: You can't shrink the number of buckets allocated for the hash using C<keys> in this way (but you needn't worry about doing this by accident, as trying has no effect).
es_es: No puede reducir el número de alojamientos reservados para el hash usando C<keys> de esta manera (pero no necesita preocuparse si hace esto por accidente; intentarlo no tiene ningún efecto).

source: In list context, it returns a list of values counting (up by ones) from the left value to the right value.
es_es: En contexto de lista, devuelve una lista de valores contando (de uno en uno) desde el valor de la izquierda al valor de la derecha.

source: Subroutines declarations can also be loaded up with the C<require> statement or both loaded and imported into your namespace with a C<use> statement.
es_es: Las declaraciones de subrutinas pueden cargarse también con la instrucción C<require> o cargadas e importadas en su espacio de nombres con la instrucción C<use>.

source: Using this, one can control Perl's idea of filenames and line numbers in error or warning messages (especially for strings that are processed with C<eval()>).
es_es: Usando esto, uno puede controlar la idea que tiene Perl de los nombres de archivos y número de líneas en los mensajes de avisos y errores (especialmente para las cadenas procesadas con C<eval()>).

source: 3 nlink 3 day 3 subroutine $\ output separator
es_es: 3 nlink 3 día 3 subrutina $\ separador entrada

source: =head2 Can I do [task] in Perl?
es_es: =head2 ¿Puedo hacer [tarea] en Perl?

source: VMS: fix perl -P
es_es: VMS: arreglado perl -P

source: # These examples are subject to system-specific variation.
es_es: # Estos ejemplos están sujetos a variaciones específicas del sistema.

source: This is similar in spirit to, but not the same as, grep(1) and its relatives.
es_es: Es similar en espíritu, pero no lo mismo, que con grep(1) y sus hermanos.

source: testing...
es_es: comprobando...

source: If EXPR is omitted, returns sine of C<$_>.
es_es: Si EXPR se omite, devuelve el seno de C<$_>.

source: The Google search engine now carries archived and searchable newsgroup content.
es_es: El motor de búsqueda de Google permite realizar búsquedas en contenido archivado de grupos de noticias:

# X<newline> X<line terminator> X<eol> X<end of line> X< > X<> X< >
source: X<newline> X<line terminator> X<eol> X<end of line> X<\n> X<\r> X<\r\n>
es_es: X<newline> X<line terminator> X<eol> X<end of line> X<\n> X<\r> X<\r\n> X<nueva línea> X<fin de línea> X<terminador de línea>

source: For example, given this code:
es_es: Por ejemplo, dado este código:

source: The most visible difference is that, in Perl 5, parentheses are required around the argument to C<given()> and C<when()> (except when this last one is used as a statement modifier).
es_es: La diferencia más visible es que, en Perl 5, los paréntesis son requeridos alrededor del argumento en C<given()> y C<when()> (excepto cuando éste último se usa como modificador de instrucciones)

source: left + - .
es_es: izquierda + - .

source: This wasn't previously the case.
es_es: Esto no es lo que ocurría anteriormente.

source: Along the same lines, just because you I<CAN> omit parentheses in many places doesn't mean that you ought to:
es_es: De la misma forma, sólo porque usted I<PUEDA> omitir paréntesis en muchos lugares no significa que deba hacerlo:

source: Any enums with negative values are now skipped.
es_es: Cualquier enum con valores negativos es ahora omitido.

source: perllocale Perl locale support
es_es: perllocale Compatibilidad con la configuración regional

source: In this case, only the C<g> and C<c> flags on the empty pattern are honored; the other flags are taken from the original pattern.
es_es: En este caso, sólo las opciones C<g> y C<c> en el patrón vacío son tomadas en cuenta; las otras opciones son tomadas del patrón original.

source: =head2 Exponentiation X<**> X<exponentiation> X<power>
es_es: =head2 Exponenciación X<**> X<exponentiation> X<power> X<exponenciación> X<elevado>

source: s/^=(\w+)/pod($1)/ge; # use function call
es_es: s/^=(\w+)/pod($1)/ge; # usa una función de llamada

source: For example, this code:
es_es: Por ejemplo, este código:

source: Another example switched the first "latin1" encoding it finds to "utf8" in a pod file:
es_es: En este otro ejemplo se cambia la primera ocurrencia de la codificación "latin1" que se encuentra a "utf8", en un archivo pod:

source: =head3 Binary strings (byte strings)
es_es: =head3 Cadenas binarias (cadenas de bytes)

source: For the pattern of regex operators (C<qr//>, C<m//> and C<s///>), the quoting from C<\Q> is applied after interpolation is processed, but before escapes are processed.
es_es: Para el patrón de los operadores regex (C<qr//>, C<m//> y C<s///>), el efecto de C<\Q> es aplicado después de que se haya procesado la interpolación, pero antes de que sean procesados los escapados.

source: =item mkdir FILENAME
es_es: =item mkdir ARCHIVO

source: 4 - either a real number, or a string that looks like a number
es_es: 4 - o un número real, o una cadena que se parezca a un número.

source: When searching for the terminating line of a here-doc, nothing is skipped.
es_es: Durante la búsqueda de la línea de terminación de un documento incrustado, nada se omite.

source: The deeper underlying truth is that juxtaposition in regular expressions always means AND, except when you write an explicit OR using the vertical bar.
es_es: La verdad más profunda que subyace es que la yuxtaposición de las expresiones regulares siempre significa Y, excepto cuando se escribe un explícito O, mediante la barra vertical.

source: =head1 What's New in Perl for MPE/iX
es_es: =head1 Qué hay de nuevo en Perl para MPE/iX

# printf "%2$*3$d %d ", 12, 34, 3; # will print " 34 12 "
source: printf "%2\$*3\$d %d\n", 12, 34, 3; # will print " 34 12\n"
es_es: printf "%2\$*3\$d %d\n", 12, 34, 3; # imprimirá " 34 12\n"

source: @a = scalar(@b) || @c; # really meant this
es_es: @a = scalar(@b) || @c; # quiere realmente decir esto

source: This is another step where the presence of the C<//x> modifier is relevant.
es_es: Este es otro paso donde la presencia del modificador C<//x> es relevante.

source: We can deal with this by using both an assertion and a negation.
es_es: Podemos lidiar con este problema utilizando una afirmación y una negación.

source: =item split /PATTERN/,EXPR,LIMIT X<split>
es_es: =item split /PATRÓN/,EXPR,LÍMITE X<split>

source: the target string is encoded in UTF-8; or
es_es: la cadena destino está codificado en UTF-8; o

source: u A uuencoded string.
es_es: u Una cadena codificada con uuencode.

source: These operators will assume a bit vector operation is desired when both operands are strings.
es_es: Estos operadores asumirán una operación de vector de bits cuando ambos operandos sean cadenas.

source: by Randal L. Schwartz, Tom Phoenix, and brian d foy
es_es: Randal L. Schwartz, Tom Phoenix y brian d foy

source: Many of the rarer platforms that worked 100% or pretty close to it with perl 5.8.0 have been left a little bit untended since their maintainers have been otherwise busy lately, and therefore there will be more failures on those platforms.
es_es: Muchas de las plataformas más raras en las que funcionaba al 100% o muy cerca de ello con perl 5.8.0 se han quedado un poco descuidadas debido a que sus responsables se han ocupado últimamente de otras cosas, y por lo tanto habrá más fallos en esas plataformas.

source: It returns the number of characters replaced or deleted.
es_es: Devuelve el número de caracteres sustituidos o eliminados.

source: on Perl 5.14 or later
es_es: en Perl 5.14 o superior

source: The syntax following the keyword is defined entirely by the extension.
es_es: La sintasix que sigue al identificador se define enteramente por la expansión.

source: =head2 How stable is Perl?
es_es: =head2 ¿Es Perl estable?

source: As a scalar operator:
es_es: Como operador escalar:

source: The C<< => >> operator is mostly just a more visually distinctive synonym for a comma, but it also arranges for its left-hand operand to be interpreted as a string if it's a bareword that would be a legal simple identifier.
es_es: El operador C<< => >> es más que nada un distintivo visual sinónimo de una coma, además de que también se encarga de que su operando de la izquierda sea interpretado como una cadena, si es un palabra suelta que pudiera ser un simple identificador legal.

source: The latest versions are probably the least deployed and widely tested, so you may want to wait a few months after their release and see what problems others have if you are risk averse.
es_es: Las versiones más recientes suelen estar menos implementadas y probadas. Si no le gusta arriesgar, es posible que prefiera esperar unos meses para ver qué problemas detectan los usuarios.

source: See L<POSIX/POSIX::SigAction>.
es_es: Vea L<POSIX/POSIX::SigAction>.

source: $var = "value";
es_es: $var = "valor";

source: This document can be read I<as is>: as F<README.uts>, or you can read it after you build your package using "man perluts".
es_es: Este documento se puede leer I<tal cual>: como F<README.uts>, o puede leerlo después de construir el paquete usando "man perluts".

source: By default, their results are interpreted as unsigned integers, but if C<use integer> is in effect, their results are interpreted as signed integers.
es_es: De forma predeterminada, los resultados se interpretan como enteros sin signo, pero si C<use integer> está en efecto, sus resultados se interpretan como enteros con signo.

source: right ! ~ \ and unary + and -
es_es: right ! ~ \ unarios + y -

source: by Darren Chamberlain, Dave Cross, and Andy Wardley
es_es: Darren Chamberlain, Dave Cross y Andy Wardley

source: shutdown(SOCKET, 1); # I/we have stopped writing data
es_es: shutdown(SOCKET, 1); # Hemos dejado de escribir datos

source: Recurse to a named subpattern.
es_es: Procesa de forma recursiva un sub-patrón con nombre.

source: perl573delta Perl changes in version 5.7.3
es_es: perl573delta Cambios en la versión 5.7.3

source: Returns a random fractional number greater than or equal to C<0> and less than the value of EXPR.
es_es: Devuelve un número decimal aleatorio mayor o igual a C<0> y menor que el valor de EXPR.

# print STDERR "This is your final warning. ";
source: print STDERR "This is your final warning.\n";
es_es: print STDERR "Ésta es la última advertencia.\n";

source: Comments can be embedded in a TEMPLATE using C<#> through the end of line.
es_es: Comentarios pueden ser integrados en una PLANTILLA usando C<#> hasta el final de la línea.

source: If POSITION is specified, returns the last occurrence beginning at or before that position.
es_es: Sí POSICIÓN es especificada, devuelve la última ocurrencia comenzando en o antes de esta posición.

source: There's a bug in the compiler (APAR PQ18812) that generates some bad code the optimizer is on.
es_es: Hay un error en el compilador (APAR PQ18812) que genera mal código cuando el optimizador está activo.

source: A zero-width negative look-ahead assertion.
es_es: Una aserción consiguiente negativa de ancho cero.

source: So you should use C<defined> only when questioning the integrity of what you're trying to do.
es_es: Así que puede usar C<defined> sólo cuando está cuestionando la integridad de lo que está intentando hacer.

source: When C<use locale> is in effect, C<sort LIST> sorts LIST according to the current collation locale.
es_es: Cuando C<use locale> esté activo, C<sort LIST> ordena LISTA de acuerdo con la actual configuración regional de intercalación.

source: foreach my $file ( @goners ) { unlink $file or warn "Could not unlink $file: $!";
es_es: foreach my $archivo ( @goners ) { unlink $archivo or warn "No puedo borrar $archivo: $!";

source: Breaks the binding between a DBM file and a hash.
es_es: Rompe la ligadura entre un archivo DBM y un hash.

source: 5.8.5 23:59:59 GMT, Wednesday June 30th 2004
es_es: 5.8.5 23:59:59 GMT miércoles, 30 de junio 2004

source: The C<delete local EXPR> construct can also be used to localize the deletion of array/hash elements to the current block.
es_es: La construcción C<delete local EXPR> también se puede utilizar para localizar la supresión de elementos de un array o hash en el bloque actual.

source: Returns like C<ioctl>: the undefined value for error, C<"0 but true"> for zero, or the actual return value otherwise.
es_es: Devuelve lo mismo que C<ioctl>: el valor indefinido para error, C<"0 but true"> para el cero, o el valor de retorno real, en caso contrario.

source: or die "Can't open 'dbase.mine' for update: $!";
es_es: or die "No puedo abrir 'dbase.mine' para actualizar: $!";

source: This function isn't all that useful for cryptography (for that, look for F<Crypt> modules on your nearby CPAN mirror) and the name "crypt" is a bit of a misnomer.
es_es: Esta función no es muy útil para criptografía (para esto, mire en los módulos F<Crypt> en su espejo CPAN más cercano) y el nombre "crypt" es un poco equívoco.

source: Because variable references always start with '$', '@', or '%', the "reserved" words aren't in fact reserved with respect to variable names.
es_es: Puesto que los nombres de variables siempre empiezan por '$', '@', o '%', las palabras "reservadas", de hecho, no están reservadas con respecto a los nombres de variables.

source: Returns the packed sockaddr address of this end of the SOCKET connection, in case you don't know the address because you have several different IPs that the connection might have come in on.
es_es: Devuelve la dirección de socket empaquetada de este final de la conexión SOCKET, en el caso de que no conozca la dirección porque tenga diferentes IP por las que la conexión se pudo haber realizado.

source: %scientists =
es_es: %cientificos =

source: ne inequality
es_es: ne distinto que

source: You can use a leading underscore to indicate that a variable or function should not be used outside the package that defined it.
es_es: Puede usar un guión bajo inicial para indicar que una variable o función no debe ser usado fuera del paquete que lo define.

source: =head2 Logical or, Defined or, and Exclusive Or X<operator, logical, or> X<operator, logical, xor> X<operator, logical, defined or> X<operator, logical, exclusive or> X<or> X<xor>
es_es: =head2 Or, Defined y Or exclusivos lógicos X<operator, logical, or> X<operator, logical, xor> X<operator, logical, defined or> X<operator, logical, exclusive or> X<or> X<xor> X<operador, lógico, or> X<operador, lógico, xor> X<operador, lógico, or exclusivo> X<operador, lógico, definido>

source: Perl has three built-in data types: scalars, arrays of scalars, and associative arrays of scalars, known as "hashes".
es_es: Perl tiene tres estructuras de datos incorporadas al lenguaje: Los escalares, los arrays de escalares, y los arrays asociativos de escalares, también conocidos como "hashes".

source: =item Functions for processes and process groups X<process> X<pid> X<process id>
es_es: =item Funciones para procesos y grupos de procesos X<process> X<pid> X<process id> X<proceso> X<id proceso>

source: In scalar context it reads a single line from the filehandle, and in list context it reads the whole file in, assigning each line to an element of the list:
es_es: En contexto escalar, este operador lee una sola línea del identificador de archivo, mientras que en contexto de lista lee todo el archivo y asigna cada línea a un elemento de la lista:

source: pesto
es_es: pisto

source: Updates for 5.8.0 by Nicholas Clark <nick@ccl4.org>
es_es: Actualizaciones para 5.8.0 de Nicholas Clark <nick@ccl4.org>

source: In particular, C<a*> inside C<a*ab> will match fewer characters than a standalone C<a*>, since this makes the tail match.
es_es: En particular, C<a*> dentro de C<a*ab> coincidirá con menos caracteres que con solo C<a*>, para permitir que el resto del patrón coincida.

source: =item stat FILEHANDLE X<stat> X<file, status> X<ctime>
es_es: =item stat IDENTIFICADOR_ARCHIVO X<stat> X<file, status> X<ctime> X<archivo, estado>

source: =head1 SEE ALSO
es_es: =head1 VEA TAMBIÉN
